Tekla.Structures.AnalysisInternal.AnalysisChangeManagement.PartProfileDiff
Part profile difference.

Tekla.Structures.AnalysisInternal.AnalysisChangeManagement.PartProfileDiff.#ctor(Tekla.Structures.Identifier,System.Int32,System.String,System.String)
Initializes a new instance of the Tekla.Structures.AnalysisInternal.AnalysisChangeManagement.PartProfileDiff class.
id: The object identifier.
posIndex: The position index.
physicalProfile: The physical profile.
analysisProfile: The analysis profile.

Tekla.Structures.AnalysisInternal.AnalysisChangeManagement.PartProfileDiff.PosIndex
Gets the position index.

Tekla.Structures.AnalysisInternal.AnalysisChangeManagement.PartProfileDiff.PhysicalProfile
Gets the physical profile.

Tekla.Structures.AnalysisInternal.AnalysisChangeManagement.PartProfileDiff.AnalysisProfile
Gets the analysis profile.